import mochaOvercoat from "./assets/mocha-overcoat.jpg";
import dreamGown from "./assets/dream-gown.jpg";
import rainJacket from "./assets/rain-jacket.jpg";
import merlotSuit from "./assets/merlot-suit.jpg";
import moonlightDress from "./assets/moonlight-dress.jpg";
import denimPioneer from "./assets/denim-pioneer.jpg";

export const DUMMY_PRODUCTS = [
  {
    id: "p1",
    image: mochaOvercoat,
    title: "Ұлыс Винтажды Мока Каптаны",
    price: 129.99,
    description:
      "Бұл таңғажайып мока каптанымен мәңгілік нәзіктікті жеткізіңіз. Винтажды әсемдік пен заманауи сәннің нәзік қоспасын бағалайтын талғампаз әжім үшін жасалған.",
  },
  {
    id: "p2",
    image: dreamGown,
    title: "Сиқырлы Қызғылт Түс Армандағы Көйлек",
    price: 189.99,
    description:
      "Сәнділіктің жарқырауында бізге қосылыңыз, біздің Сиқырлы Қызғылт Түс Армандағы Көйлекпен. Пияздың тәтті түркісімен ханшайымның әсемдігін бейнелеп, ұмытылмас сәттер жасауға арналған мінсіз киім.",
  },

  {
    id: "p3",
    image: rainJacket,
    title: "Винтажды Күншуақты Жаңбыр Каптаны",
    price: 49.99,
    description:
      "Стильмен жаңбырды қарсы алыңыз! Біздің Винтажды Күншуақты Жаңбыр Каптанымыз ең суық ауа райында да көз тартарлық болуға көмектеседі. Себебі жаңбыр – сәнге компромисс жасаудың себебі емес.",
  },
  {
    id: "p4",
    image: merlotSuit,
    title: "Классикалық Мерло Бизнес Костюмі",
    price: 249.99,
    description:
      "Классикалық Мерло Бизнес Костюмімен кеңсе залына салыстырмалас сеніммен кіріңіз. Таза класс пен қарапайым күштің ауасын тарататын бұл костюм дәстүр мен сәнді бағалайтын заманауи басшыға арналған.",
  },
  {
    id: "p5",
    image: moonlightDress,
    title: "Ефирлі Айшуақты Кешкі Көйлек",
    price: 159.99,
    description:
      "Біздің Ефирлі Айшуақты Кешкі Көйлекпен бөлмені таң қалдырыңыз. Айшуақты әсемдікті имитациялау үшін жасалған бұл көйлек нәзік сәнділік пен ерекше силуэтке құштар адамдарға арналған.",
  },
  {
    id: "p6",
    image: denimPioneer,
    title: "Пионер Қатты Деним Каптаны",
    price: 79.99,
    description:
      "Біздің Пионер Қатты Деним Каптанымыз шытырман өмірге деген рухты білдіретіндерге арналады. Төзімділік пен жайлылықты ескере отырып жасалған бұл каптан қалалық зерттеушілердің гардеробының негізгі бөлігі болып табылады.",
  },
];
